[
    {
        "image": "https://play-lh.googleusercontent.com/pNGkIZUX7IwnWKkm_kSPGHMmCyifRVk7kAfM4IyFoINslkOxMuhXfIcNIX3GXFgoFHQ=w240-h480-rw",
        "title": "Fitness Tracker Pro",
        "companyName": "FitLife Solutions",
        "id": 1,
        "description": "Fitness Tracker Pro is your ultimate companion for achieving your health and fitness goals. This comprehensive application provides an intuitive interface to log your workouts, monitor your progress, and stay motivated on your wellness journey.\nWhether you're a seasoned athlete or just starting out, Fitness Tracker Pro offers personalized workout plans, a vast exercise library with detailed instructions, and insightful analytics to help you understand your performance.\nTrack your steps, calories burned, distance covered, and even monitor your heart rate directly from the app, integrating seamlessly with popular wearable devices. The app's design prioritizes ease of use, ensuring that you can spend more time focusing on your fitness and less time navigating complex menus.\nGet ready to transform your lifestyle with a powerful tool designed to support every step of your journey.",
        "size": 75,
        "reviews": 12500,
        "ratingAvg": 4.7,
        "downloads": 5000000,
        "ratings": [
            {
                "name": "1 star",
                "count": 150
            },
            {
                "name": "2 star",
                "count": 250
            },
            {
                "name": "3 star",
                "count": 1000
            },
            {
                "name": "4 star",
                "count": 3500
            },
            {
                "name": "5 star",
                "count": 7600
            }
        ]
    },
    {
        "image": "https://play-lh.googleusercontent.com/8yzOYG4sa-cZHOWlT1J-DwrbzRRodr0FKNkWCMf1VsJV9BBZps6qufCp5qOA6njyFDk=w240-h480-rw",
        "title": "Mindful Meditations",
        "companyName": "Inner Peace Apps",
        "id": 2,
        "description": "Mindful Meditations offers a sanctuary for your mind, providing a diverse collection of guided meditations designed to reduce stress, improve focus, and promote overall well-being. Dive into sessions tailored for sleep, anxiety relief, self-compassion, and more, all crafted by experienced mindfulness instructors. \nThe app features customizable meditation lengths, soothing background sounds, and progress tracking to help you build a consistent practice.\nRegular meditation can significantly impact your mental clarity and emotional resilience, and Mindful Meditations makes it accessible to everyone, regardless of their experience level. Start your day with a calming intention, find peace during a busy afternoon, or unwind before sleep with our carefully curated content, fostering a healthier relationship with your thoughts and emotions. Embrace tranquility with every session.",
        "size": 75,
        "reviews": 12500,
        "ratingAvg": 4.7,
        "downloads": 5000000,
        "ratings": [
            {
                "name": "1 star",
                "count": 250
            },
            {
                "name": "2 star",
                "count": 380
            },
            {
                "name": "3 star",
                "count": 800
            },
            {
                "name": "4 star",
                "count": 3500
            },
            {
                "name": "5 star",
                "count": 7570
            }
        ]
    },
    {
        "image": "https://play-lh.googleusercontent.com/7BX8mKOoevmnZf4Ez02-Uprpn2ZtJ0p5sxv7R_5WvHZ-Nknxdtjq8LTgN6DZw17Fw9UE=w240-h480-rw",
        "title": "Recipe Master",
        "companyName": "Culinary Creations Inc",
        "id": 3,
        "description": "Recipe Master is your go-to culinary companion, offering a vast collection of recipes for every occasion, skill level, and dietary preference. From quick weeknight dinners to elaborate gourmet meals, explore thousands of recipes with detailed instructions, ingredient lists, and beautiful images.\n The app allows you to save your favorite recipes, create shopping lists directly from ingredients, and even plan your meals for the week. Discover new cuisines, adapt recipes to your taste, and effortlessly share your culinary triumphs with friends and family. With advanced search filters, you can easily find recipes based on ingredients you have on hand, cooking time, or specific dietary needs such as vegetarian, vegan, gluten-free, or low-carb. Elevate your cooking experience and unleash your inner chef with Recipe Master, making every meal an adventure in flavor and creativity. Get ready to explore the exciting world of gastronomy with a rich resource.",
        "size": 120,
        "reviews": 15000,
        "ratingAvg": 4.6,
        "downloads": 7500000,
        "ratings": [
            {
                "name": "1 star",
                "count": 200
            },
            {
                "name": "2 star",
                "count": 300
            },
            {
                "name": "3 star",
                "count": 1200
            },
            {
                "name": "4 star",
                "count": 4300
            },
            {
                "name": "5 star",
                "count": 9000
            }
        ]
    },
    {
        "image": "https://play-lh.googleusercontent.com/QB07_fGHn5otW1h4oCLuNmGmTzAl1aPyrg0Fq83eUQ0rGEicLwkyuFUJaCSjRrqmBw=w240-h480-rw",
        "title": "Expense Tracker Deluxe",
        "companyName": "BudgetWise Solutions",
        "id": 4,
        "description": "Expense Tracker Deluxe simplifies your financial management, helping you gain complete control over your spending and savings. This powerful app provides an intuitive platform to log all your income and expenses, categorize transactions, and visualize your financial health with insightful charts and graphs.\n Set monthly budgets, receive alerts when you're approaching your limits, and identify areas where you can save more. With robust reporting features, you can easily export your data for tax purposes or personal analysis, ensuring you always have a clear picture of where your money is going. The app supports multiple currencies and accounts, making it ideal for both personal and business use. Take the stress out of budgeting and make informed financial decisions with Expense Tracker Deluxe. Achieve your financial goals by understanding your spending habits and strategically planning for the future, fostering a sense of security and freedom in your financial life.",
        "size": 60,
        "reviews": 9800,
        "ratingAvg": 4.8,
        "downloads": 3500000,
        "ratings": [
            {
                "name": "1 star",
                "count": 180
            },
            {
                "name": "2 star",
                "count": 220
            },
            {
                "name": "3 star",
                "count": 600
            },
            {
                "name": "4 star",
                "count": 3000
            },
            {
                "name": "5 star",
                "count": 5800
            }
        ]
    },
    {
        "image": "https://play-lh.googleusercontent.com/tw_coGKgk1K_zO-Ypf9zBKV1s-KT3dYN1MIUxIqtnbfmON5x_YmuoAr31gE4oSfJHNtA-aStTd-qe9R8S6NVyA=w240-h480-rw",
        "title":  "Duolingo Pro",
        "companyName": "Global Speak Labs",
        "id": 5,
        "description": "Duoling Pro makes mastering a new language an engaging and effective experience. Choose your desired language and immerse yourself in interactive lessons, vocabulary builders, and pronunciation exercises organized by our comprehensive curriculum. The app incorporates spaced repetition, adaptive learning algorithms, and real-life conversational scenarios to ensure you retain what you learn. \nPractice your speaking, listening, reading, and writing skills with our curriculum, developed by expert linguists. Track your progress, earn achievements, and get personalized recommendations. Connect with a community of fellow learners to stay motivated. \nWhether you're planning a trip abroad, advancing your career, or simply curious about other cultures, Duoling Pro provides all the tools you need to succeed. Unlock new opportunities and broaden your horizons by communicating fluently in another language, opening doors to new experiences and understanding. Embark on your linguistic adventure today and discover a world of possibilities.",
        "size": 150,
        "reviews": 18000,
        "ratingAvg": 4.7,
        "downloads": 9000000,
        "ratings": [
            {
                "name": "1 star",
                "count": 250
            },
            {
                "name": "2 star",
                "count": 350
            },
            {
                "name": "3 star",
                "count": 1500
            },
            {
                "name": "4 star",
                "count": 5000
            },
            {
                "name": "5 star",
                "count": 10900
            }
        ]
    },
    {
        "image": "https://play-lh.googleusercontent.com/jJmH7mOVnASIuhVRzpcCxLNOXCRq9xxCtIhmDF9cboSV--sciNT7_zoX6ztv6ijtsrmej0op7AX0se9v4KfT=w240-h480-rw",
        "title": "Photo Editor Studio",
        "companyName": "Creative Pixel",
        "id": 6,
        "description": "Photo Editor Studio transforms your ordinary photos into stunning masterpieces with an extensive suite of powerful editing tools. Enhance your images with professional-grade filters, adjust brightness, contrast, saturation, and exposure, and apply artistic effects to create unique looks. \n\nThe app features advanced retouching tools for perfecting portraits, removing blemishes, and smoothing skin, along with precise cropping and rotation functions. Experiment with overlays, frames, and text to add personal touches to your creations. Whether you're a photography enthusiast or a casual snapper, Photo Editor Studio provides an intuitive interface that makes professional editing accessible to everyone. Unleash your creativity and express your unique vision through your photographs, turning every shot into a work of art ready to be shared. Elevate your visual storytelling and make your memories truly shine with endless possibilities. Discover the joy of crafting beautiful images effortlessly.",
        "size": 110,
        "reviews": 22000,
        "ratingAvg": 4.6,
        "downloads": 12000000,
        "ratings": [
            {
                "name": "1 star",
                "count": 300
            },
            {
                "name": "2 star",
                "count": 400
            },
            {
                "name": "3 star",
                "count": 1800
            },
            {
                "name": "4 star",
                "count": 6000
            },
            {
                "name": "5 star",
                "count": 13500
            }
        ]
    },
    {
        "image": "https://play-lh.googleusercontent.com/snWb0KyG-EkpMR77wqSTqDAXMlNlKDBV6MAOhuqnkDqrSwYboa39qSruxk3UdozXN6s=w240-h480-rw",
        "title": "Sleep Soundscapes",
        "companyName": "Dream Weaver Labs",
        "id": 7,
        "description": "Sleep Soundscapes guides you to a peaceful night's rest with a rich collection of ambient sounds, calming melodies, and guided sleep meditations. \nEscape the hustle and bustle of daily life and create your ideal sleep environment with customizable sound mixes, from gentle rain and ocean waves to crackling fireplaces and serene forest atmospheres. \nThe app features a smart timer, allowing you to set a duration for your soundscapes, and gentle alarms to wake you up refreshed. Combat insomnia, reduce restlessness, and improve your overall sleep quality with scientifically backed audio that promotes deep relaxation. Whether you struggle with falling asleep or simply want to enhance your nightly routine, Sleep Soundscapes offers a tranquil refuge. Discover the power of sound to soothe your mind and body, ensuring you wake up feeling revitalized and ready to face the day, fostering a profound sense of peace and rejuvenation. Achieve the restful sleep you deserve.",
        "size": 65,
        "reviews": 11000,
        "ratingAvg": 4.5,
        "downloads": 4500000,
        "ratings": [
            {
                "name": "1 star",
                "count": 280
            },
            {
                "name": "2 star",
                "count": 320
            },
            {
                "name": "3 star",
                "count": 700
            },
            {
                "name": "4 star",
                "count": 3200
            },
            {
                "name": "5 star",
                "count": 6500
            }
        ]
    },
    {
        "image": "https://play-lh.googleusercontent.com/_cgWAzDGXJKYnkHxOrOfwVQgoaY24lv_R6x4UXezaY4V3D738wcr2TYMqnW6qOPg3Fkj=w240-h480-rw",
        "title": "Task Organizer Pro",
        "companyName": "Productivity Hub",
        "id": 8,
        "description": "Task Organizer Pro is your ultimate productivity tool, designed to help you manage your tasks, projects, and deadlines with unparalleled efficiency. Its intelligent engine helps you create detailed to-do lists, set reminders, and prioritize your commitments with an intuitive drag-and-drop interface. Break down complex projects into manageable sub-tasks, assign due dates, and track your progress visually. The app offers customizable categories, tags, and filters to help you quickly find what you need and stay focused on your most important objectives. \nSynchronize your tasks across all your devices, ensuring you're always up-to-date. Reduce stress and increase your output by streamlining your workflow and never missing a beat. Take control of your day, achieve your goals, and free up valuable mental space to focus on what truly matters, fostering a sense of accomplishment and clarity. Master your time and conquer your to-do list effortlessly.",
        "size": 50,
        "reviews": 13000,
        "ratingAvg": 4.7,
        "downloads": 6500000,
        "ratings": [
            {
                "name": "1 star",
                "count": 150
            },
            {
                "name": "2 star",
                "count": 220
            },
            {
                "name": "3 star",
                "count": 1100
            },
            {
                "name": "4 star",
                "count": 4000
            },
            {
                "name": "5 star",
                "count": 7530
            }
        ]
    },
    {
        "image": "https://play-lh.googleusercontent.com/9MD3biGQRiYH8NdM6MT4uU9CFEBdeyjwA5OV5Ucab0vjF6O1PD7qIF63FhSk-eqksA=w240-h480-rw",
        "title": "Stock Market Insights",
        "companyName": "Invest Smart Solutions",
        "id": 9,
        "description": "Stock Market Insights provides real-time data exploration, empowering you with expert analysis and powerful tools to help you make informed investment decisions. Track your portfolio, monitor your favorite stocks, and receive breaking news alerts that could impact your investments. Access detailed company financials, historical performance charts, and analyst ratings to gain a comprehensive understanding of market trends. The app features customizable watchlists, allowing you to keep a close eye on the stocks that matter most to you, and integrates with leading brokerage platforms for seamless trading. Whether you're a seasoned investor or just starting out, Stock Market Insights equips you with the knowledge and confidence to navigate the complexities of the financial world. Stay ahead of the curve with timely information and strategic insights, empowering you to optimize your investment strategy and achieve your financial aspirations. Unlock your potential in the dynamic world of stock trading.",
        "size": 95,
        "reviews": 13000,
        "ratingAvg": 4.7,
        "downloads": 5500000,
        "ratings": [
            {
                "name": "1 star",
                "count": 260
            },
            {
                "name": "2 star",
                "count": 310
            },
            {
                "name": "3 star",
                "count": 850
            },
            {
                "name": "4 star",
                "count": 3600
            },
            {
                "name": "5 star",
                "count": 7980
            }
        ]
    },
    {
        "image": "https://play-lh.googleusercontent.com/PuhC_QbbglkPqmN4sYcamXaee0J1TPhtsdIC2RcF_acR25OMWytv7EiR7PomDwKgwu-e=w240-h480-rw",
        "title": "Travel Life | Trip Planner",
        "companyName": "Wanderlust Tech",
        "id": 10,
        "description": "Travel Planner Plus is your essential companion for crafting unforgettable journeys, from meticulous itineraries to discovering hidden gems. Plan every detail of your trip with ease, including flights, accommodations, activities, and dining reservations, all within a single, organized platform. \nCreate custom itineraries, share them with travel companions, and receive real-time updates on your bookings, enhancing your experience. The app features extensive destination guides, complete with maps, local attractions, and user reviews, helping you explore like a local. Budget tracking tools allow you to monitor your expenses, ensuring you stay within your financial limits throughout your adventure. Whether you're embarking on a solo backpacking trip or a family vacation, Travel Planner Plus streamlines the entire planning process. Make your travel dreams a reality with a tool that takes the stress out of logistics and lets you focus on creating lasting memories. \nExperience the world with confidence and convenience.",
        "size": 105,
        "reviews": 16000,
        "ratingAvg": 4.6,
        "downloads": 8000000,
        "ratings": [
            {
                "name": "1 star",
                "count": 220
            },
            {
                "name": "2 star",
                "count": 300
            },
            {
                "name": "3 star",
                "count": 1300
            },
            {
                "name": "4 star",
                "count": 4800
            },
            {
                "name": "5 star",
                "count": 9380
            }
        ]
    },
    {
        "image": "https://play-lh.googleusercontent.com/ra-Kezv9FD-7tCOPVoG79NSa_ozTeDWhvzFwVhBYARkY3FA0uRf23K-Dk7O5fGNklVrc=w240-h480-rw",
        "title": "PetPal Connect",
        "companyName": "Furry Friends Tech",
        "id": 11,
        "description": "PetPal Connect is the ultimate social hub for pet owners and animal lovers. \nThis app allows you to connect with a community of fellow enthusiasts, share adorable photos and videos of your pets, and get advice on pet care. Whether you have a dog, cat, bird, or exotic pet, PetPal Connect provides a welcoming space to celebrate your animal companions. Create detailed profiles for your pets, highlighting their personalities and special moments. \nDiscover local pet-friendly places, events, and services, making it easier to enjoy outings with your furry, feathered, or scaled friends. PetPal Connect fosters a supportive environment where every pet owner feels understood and valued, enhancing the joy of pet ownership. Beyond social sharing, \nPetPal Connect offers essential pet care resources. Access articles and expert advice on pet nutrition, training tips, health concerns, and behavioral issues. Find reputable veterinarians, groomers, and pet sitters in your area with user reviews and ratings. The app includes a lost and found feature, helping reunite lost pets with their worried owners through community alerts. Organize playdates for your pets with their worried owners through community alerts. Organize playdates for your pets, join breed-specific groups, and participate in fun challenges to showcase your pet's talents. Get personalized recommendations for pet products and services based on your pet's breed, age, and health needs, ensuring they receive the best possible care. \nPetPal Connect is committed to building a compassionate and engaged community. Regular updates introduce new features, pet care resources, and social functionalities based on user feedback and veterinary advancements. The vibrant interface is designed to make sharing and connecting easy and enjoyable. Data privacy is paramount, protecting your pet's information and personal interactions. Premium features include exclusive access to pet care webinars, advanced pet health tracking tools, ad-free browsing, and special discounts on pet products. \nPetPal Connect is more than just a social app; it's a comprehensive platform that strengthens the bond between pets and their owners, fostering a world where every animal thrives with love and excellent care.",
        "size": 70,
        "reviews": 10800,
        "ratingAvg": 4.7,
        "downloads": 4600000,
        "ratings": [
            {
                "name": "1 star",
                "count": 220
            },
            {
                "name": "2 star",
                "count": 270
            },
            {
                "name": "3 star",
                "count": 720
            },
            {
                "name": "4 star",
                "count": 3300
            },
            {
                "name": "5 star",
                "count": 6290
            }
        ]
    },
    {
        "image": "https://play-lh.googleusercontent.com/dJfHtJZAyAhgpDPVqMJ8nRtXk_0XBPkBOHliej3d6Xc0oEidaLaKz9V7-ZtyyvhSUfs=w240-h480-rw",
        "title": "Healthy Recipes Hub",
        "companyName": "NutriCook Apps",
        "id": 12,
        "description": "Healthy Recipes Hub is your daily source for delicious and nutritious meal ideas, helping you maintain a balanced diet and achieve your wellness goals. Explore thousands of recipes tailored for various dietary needs, including low-carb, high-protein, vegetarian, vegan, gluten-free, and more. Each recipe comes with detailed nutritional information, step-by-step instructions, and vibrant photos to inspire your cooking. \nThe app allows you to create meal plans, generate shopping lists, and customize recipes to fit your preferences. Discover new ingredients, learn healthy cooking techniques, and easily share your culinary creations with friends and family. Whether you're looking to lose weight, gain energy, or simply eat better, Healthy Recipes Hub provides all the tools you need to make healthy eating enjoyable and sustainable. Transform your kitchen into a hub of healthy innovation and savor every bite, fostering a vibrant lifestyle full of flavor and vitality. Achieve the restful sleep you deserve.",
        "size": 85,
        "reviews": 11500,
        "ratingAvg": 4.8,
        "downloads": 4800000,
        "ratings": [
            {
                "name": "1 star",
                "count": 230
            },
            {
                "name": "2 star",
                "count": 280
            },
            {
                "name": "3 star",
                "count": 780
            },
            {
                "name": "4 star",
                "count": 3400
            },
            {
                "name": "5 star",
                "count": 6810
            }
        ]
    },
    {
        "image": "https://play-lh.googleusercontent.com/8kyIhRnPcJpiIpr9-ow84YTi-bftaY968AIlrh8HIDYS1OiJXX1xc7cGlXcIw0NrLA=w240-h480-rw",
        "title": "Personal Finance Coach",
        "companyName": "Wealth Builders",
        "id": 13,
        "description": "Personal Finance Coach empowers you to take control of your financial future with personalized guidance and intelligent tools.\nTrack your income, expenses, investments, and debts in one secure platform, gaining a holistic view of your financial landscape. Set financial goals, such as saving for a down payment, retirement, or a major purchase, and receive actionable insights to help you reach them faster. The app offers budgeting tools, debt repayment calculators, and investment portfolio trackers, providing a comprehensive solution for managing your money effectively. Connect your bank accounts for automatic transaction syncing and categorize your spending with ease. With Personal Finance Coach, you can make informed financial decisions, build wealth, and achieve financial independence. Transform your financial habits and secure a prosperous future, fostering peace of mind and confidence in your monetary journey. Start building your legacy today with smart financial planning.",
        "size": 70,
        "reviews": 9200,
        "ratingAvg": 4.7,
        "downloads": 3800000,
        "ratings": [
            {
                "name": "1 star",
                "count": 110
            },
            {
                "name": "2 star",
                "count": 180
            },
            {
                "name": "3 star",
                "count": 750
            },
            {
                "name": "4 star",
                "count": 3000
            },
            {
                "name": "5 star",
                "count": 5160
            }
        ]
    },
    {
        "image": "https://play-lh.googleusercontent.com/Y3ZzMWr4w3QJU5ouhVWGDhz68EjOkH6_QIFWf2dOHhspWAidRDgY042s-DfVJSuNtGfZ-qf7uQ7lKzi9JRfOlA=w240-h480-rw",
        "title": "Creative Writing Prompts",
        "companyName": "Story Weaver Studios",
        "id": 14,
        "description": "Creative Writing Prompts sparks your imagination and helps you overcome writer's block with an endless supply of inspiring ideas. Whether you're a seasoned novelist, an aspiring poet, or just looking to flex your creative muscles, this app offers a diverse collection of prompts across various genres and styles. \nExplore character generators, plot twists, world-building ideas, and dialogue starters to kick-start your next masterpiece. The app allows you to save your favorite prompts, mark those you've used, and even contribute your own ideas to the community. With daily prompts and challenges, you'll always find fresh inspiration to keep your writing flowing. Unleash your inner storyteller and transform abstract ideas into captivating narratives, developing your craft with every word. Cultivate a consistent writing practice and discover the joy of bringing your unique stories to life. Let your creativity soar with limitless possibilities.",
        "size": 45,
        "reviews": 8900,
        "ratingAvg": 4.5,
        "downloads": 3800000,
        "ratings": [
            {
                "name": "1 star",
                "count": 210
            },
            {
                "name": "2 star",
                "count": 260
            },
            {
                "name": "3 star",
                "count": 680
            },
            {
                "name": "4 star",
                "count": 2800
            },
            {
                "name": "5 star",
                "count": 4950
            }
        ]
    },
    {
        "image": "https://play-lh.googleusercontent.com/ggZPWxmcQiSsR5HDj7mBQB3qsThcqPyfCDkDTRaIRxwLEm8Q9GdO36s4jcQ93IjkgJoffQXJsOVZIdfUG5I37A=w240-h480-rw",
        "title": "Art Gallery Explorer",
        "companyName": "Culture Connect",
        "id": 15,
        "description": "Art Gallery Explorer is your personal guide to the world's most renowned art collections, allowing you to discover masterpieces from the comfort of your device. Browse high-resolution images of paintings, sculptures, and historical artifacts from famous museums and galleries around the globe. Learn about artists, art movements, and the stories behind iconic works with detailed descriptions and engaging audio guides. The app features virtual tours, allowing you to navigate through digital recreations of gallery spaces, and offers personalized recommendations based on your artistic preferences. Save your favorite artworks, create your own virtual collections, and share your visual discoveries with friends and family. \nImmerse yourself in the beauty and history of art, expanding your cultural horizons and deepening your appreciation for human creativity. Connect with art on a profound level, fostering a lifelong passion for visual storytelling and cultural heritage.",
        "size": 180,
        "reviews": 11500,
        "ratingAvg": 4.7,
        "downloads": 6000000,
        "ratings": [
            {
                "name": "1 star",
                "count": 160
            },
            {
                "name": "2 star",
                "count": 240
            },
            {
                "name": "3 star",
                "count": 1000
            },
            {
                "name": "4 star",
                "count": 3900
            },
            {
                "name": "5 star",
                "count": 6200
            }
        ]
    },
    {
        "image": "https://play-lh.googleusercontent.com/QOpn8VzGHmWrRsZnKOgmRtOJH07KbM_N14HlFhoXmofLW-2jzF6Ki9FBPbSiUv9LHyw=w240-h480-rw",
        "title": "Coding Playground",
        "companyName": "DevSpark Innovations",
        "id": 16,
        "description": "Coding Playground provides an interactive and accessible platform for learning to code, suitable for beginners and experienced developers alike. Master various programming languages through engaging tutorials, coding challenges, and real-time project building exercises. The app offers a built-in code editor, allowing you to write, run, and debug your code directly on your device, providing instant feedback on your solutions. Explore concepts in Python, JavaScript, HTML, CSS, and more, with clear explanations and practical examples.\nTrack your progress, earn certifications, and join a vibrant community of coders to collaborate and share your projects. Whether you're aspiring to a career in tech or simply want to develop a new skill, Coding Playground makes learning to code fun and rewarding. Unlock the power of computational thinking and transform your ideas into functional applications, fostering a problem-solving mindset and technical prowess. Build the future, one line of code at a time.",
        "size": 160,
        "reviews": 19000,
        "ratingAvg": 4.8,
        "downloads": 10000000,
        "ratings": [
            {
                "name": "1 star",
                "count": 280
            },
            {
                "name": "2 star",
                "count": 380
            },
            {
                "name": "3 star",
                "count": 1600
            },
            {
                "name": "4 star",
                "count": 5500
            },
            {
                "name": "5 star",
                "count": 11240
            }
        ]
    },
    {
        "image": "https://play-lh.googleusercontent.com/-QwgmDGu-vUNZ15EkwseSHd2elDfKum7q6qYkBWMaWHEEgefZdxyD7aPqlzDxmNAaw=w240-h480-rw",
        "title": "GreenThumb Garden Planner",
        "companyName": "Harvest Harmony",
        "id": 17,
        "description": "GreenThumb Garden Planner helps you cultivate a thriving garden, whether you're a novice or an experienced gardener.\nPlan your garden layout, choose the right plants for your climate and soil type, and receive personalized reminders for watering, fertilizing, and harvesting. The app features an extensive plant database, complete with growing guides, pest and disease information, and companion planting suggestions. Track your garden's progress with photos and notes, and connect with a community of fellow gardeners to share tips and advice. Discover seasonal planting schedules, learn about organic gardening practices, and maximize your harvest with intelligent planning tools. \nTurn your outdoor space into a vibrant sanctuary of growth and beauty with GreenThumb Garden Planner. Experience the satisfaction of nurturing life and enjoying the fruits of your labor, fostering a deeper connection with nature and sustainable living. Grow your perfect garden, one thoughtful step at a time.",
        "size": 70,
        "reviews": 8500,
        "ratingAvg": 4.6,
        "downloads": 3500000,
        "ratings": [
            {
                "name": "1 star",
                "count": 190
            },
            {
                "name": "2 star",
                "count": 240
            },
            {
                "name": "3 star",
                "count": 650
            },
            {
                "name": "4 star",
                "count": 2900
            },
            {
                "name": "5 star",
                "count": 4750
            }
        ]
    },
    {
        "image": "https://play-lh.googleusercontent.com/Dcc9LxmRj9t_zDK7-95HcSa-vHtt86RTeEHH0vmgdHE11D6cNnIJ9WWVqBTuJk31kcw=w240-h480-rw",
        "title": "Music Maker Studio",
        "companyName": "Soundscape Innovators",
        "id": 18,
        "description": "Music Maker Studio empowers aspiring musicians and seasoned producers to create professional-quality tracks directly on their mobile device. \nCompose melodies, build beats, record vocals, and mix your tracks with a comprehensive suite of digital audio tools. The app features a vast library of loops, samples, and virtual instruments, allowing you to experiment with various genres and styles. Use the intuitive sequencer to arrange your compositions, apply effects, and master your recordings for a polished sound. Share your creations with the world, collaborate with other artists, and discover new sounds within the app's community. Unleash your inner DJ, producer, or composer and turn your musical ideas into reality, fostering a profound connection with sound and rhythm. The ultimate creative outlet for audio enthusiasts.",
        "size": 200,
        "reviews": 17000,
        "ratingAvg": 4.7,
        "downloads": 8500000,
        "ratings": [
            {
                "name": "1 star",
                "count": 240
            },
            {
                "name": "2 star",
                "count": 320
            },
            {
                "name": "3 star",
                "count": 1400
            },
            {
                "name": "4 star",
                "count": 4700
            },
            {
                "name": "5 star",
                "count": 10340
            }
        ]
    },
    {
        "image": "https://play-lh.googleusercontent.com/e9tP2bQMoWjZf8gS8djWRQFwH_xBb-MCurOlbtG99vX3Z7LQo8bHrlq2Sf4pexQeww=w240-h480-rw",
        "title": "Star Gazer Pro",
        "companyName": "Cosmic View Apps",
        "id": 19,
        "description": "Star Gazer Pro transforms your device into a portable planetarium, allowing you to explore the wonders of the night sky with stunning accuracy. Simply point your phone or tablet towards the sky and identify constellations, stars, planets, satellites, and deep-sky objects in real-time. \nThe app provides detailed information about each celestial body, including its history, mythology, and scientific facts. Access interactive sky maps, view 3D models of planets and receive notifications for upcoming astronomical events like meteor showers and eclipses. Whether you're a seasoned astronomer or a curious beginner, Star Gazer Pro offers an immersive and educational experience that deepens your appreciation for the universe. \nUncover the secrets of the cosmos and embark on an awe-inspiring journey through space, fostering a sense of wonder and intellectual curiosity. The app is your personal guide to the cosmos, making astronomical exploration accessible and engaging for everyone.",
        "size": 100,
        "reviews": 12000,
        "ratingAvg": 4.8,
        "downloads": 6000000,
        "ratings": [
            {
                "name": "1 star",
                "count": 140
            },
            {
                "name": "2 star",
                "count": 200
            },
            {
                "name": "3 star",
                "count": 900
            },
            {
                "name": "4 star",
                "count": 3800
            },
            {
                "name": "5 star",
                "count": 6960
            }
        ]
    },
    {
        "image": "https://play-lh.googleusercontent.com/bYtfZ9TN51nmPLXKghVQYW3twCb8jujR09TZVCaglH7UZfsfJXuSOXXMhWlQITUb-6k=w240-h480-rw",
        "title": "Puzzle Master Collection",
        "companyName": "Brain Teaser Games",
        "id": 20,
        "description": "Puzzle Master Collection offers a diverse array of engaging brain-teasing games designed to sharpen your mind and provide hours of entertainment.\nChallenge yourself with classic puzzles like Sudoku and crosswords, or dive into unique logic puzzles, jigsaw challenges, and memory games. The app features multiple difficulty levels, ensuring a rewarding experience for players of all ages and skill sets. Track your progress, earn achievements, and compete with friends on global leaderboards. Regular brain training has been shown to improve cognitive function, problem-solving skills, and memory retention, and Puzzle Master Collection makes it fun and accessible. Whether you have a fewminutes to spare or want to dedicate an entire evening to mental exercise, you'll find a puzzle to suit your mood. Sharpen your intellect and enjoy the satisfaction of cracking every conundrum, fostering mental agility and a sense of accomplishment. Indulge in the ultimate mental workout experience.",
        "size": 65,
        "reviews": 15500,
        "ratingAvg": 4.5,
        "downloads": 7000000,
        "ratings": [
            {
                "name": "1 star",
                "count": 200
            },
            {
                "name": "2 star",
                "count": 300
            },
            {
                "name": "3 star",
                "count": 1200
            },
            {
                "name": "4 star",
                "count": 4500
            },
            {
                "name": "5 star",
                "count": 8500
            }
        ]
    }
]